/* eslint-disable */

var unescapeBackslashes = (str: string): string => {
	return str.replace(/(\\*)(`|\$\{|\\$)/g, (m, backslashes: string, c: string) => {
		return "\\".repeat(Math.floor(backslashes.length / 2)) + c;
	});
};
var lit = (array: TemplateStringsArray): string => {
	return unescapeBackslashes(array.raw[0].slice(1, -1));
};
var n = (array: TemplateStringsArray): string => {
	return unescapeBackslashes(array.raw[0].slice(0, -1));
};

module.exports[n`ENFA >> fromRegex >> /a?/ `] = lit`
(0) -> (1) : a
    -> [2] : ε

(1) -> [2] : ε

[2] -> none
`;

module.exports[n`ENFA >> fromRegex >> /a??/ `] = lit`
(0) -> [1] : ε
    -> (2) : a

[1] -> none

(2) -> [1] : ε
`;

module.exports[n`ENFA >> fromRegex >> /a+/ `] = lit`
(0) -> (1) : ε

(1) -> (2) : a

(2) -> (1) : ε
    -> [3] : ε

[3] -> none
`;

module.exports[n`ENFA >> fromRegex >> /a+?/ `] = lit`
(0) -> (1) : ε

(1) -> (2) : a

(2) -> [3] : ε
    -> (1) : ε

[3] -> none
`;

module.exports[n`ENFA >> fromRegex >> /(a|b)+c/ `] = lit`
(0) -> (1) : ε

(1) -> (2) : a
    -> (3) : b

(2) -> (4) : ε

(3) -> (4) : ε

(4) -> (1) : ε
    -> (5) : ε

(5) -> [6] : c

[6] -> none
`;

module.exports[n`ENFA >> fromRegex >> /a*b*c*/ `] = lit`
(0) -> (1) : ε
    -> (2) : ε

(1) -> (3) : a

(2) -> (4) : ε
    -> (5) : ε

(3) -> (1) : ε
    -> (2) : ε

(4) -> (6) : b

(5) -> (7) : ε
    -> [8] : ε

(6) -> (4) : ε
    -> (5) : ε

(7) -> (9) : c

[8] -> none

(9) -> (7) : ε
    -> [8] : ε
`;

module.exports[n`ENFA >> fromRegex >> /a*b*?c*/ `] = lit`
(0) -> (1) : ε
    -> (2) : ε

(1) -> (3) : a

(2) -> (4) : ε
    -> (5) : ε

(3) -> (1) : ε
    -> (2) : ε

(4) -> (6) : ε
    -> [7] : ε

(5) -> (8) : b

(6) -> (9) : c

[7] -> none

(8) -> (4) : ε
    -> (5) : ε

(9) -> (6) : ε
    -> [7] : ε
`;

module.exports[n`ENFA >> fromRegex >> /a*?b*c*?/ `] = lit`
(0) -> (1) : ε
    -> (2) : ε

(1) -> (3) : ε
    -> (4) : ε

(2) -> (5) : a

(3) -> (6) : b

(4) -> [7] : ε
    -> (8) : ε

(5) -> (1) : ε
    -> (2) : ε

(6) -> (3) : ε
    -> (4) : ε

[7] -> none

(8) -> (9) : c

(9) -> [7] : ε
    -> (8) : ε
`;

module.exports[n`ENFA >> fromRegex >> /a+b+?c+/ `] = lit`
(0) -> (1) : ε

(1) -> (2) : a

(2) -> (1) : ε
    -> (3) : ε

(3) -> (4) : ε

(4) -> (5) : b

(5) -> (6) : ε
    -> (4) : ε

(6) -> (7) : ε

(7) -> (8) : c

(8) -> (7) : ε
    -> [9] : ε

[9] -> none
`;

module.exports[n`ENFA >> fromRegex >> /a{4}/ `] = lit`
(0) -> (1) : a

(1) -> (2) : a

(2) -> (3) : a

(3) -> [4] : a

[4] -> none
`;

module.exports[n`ENFA >> fromRegex >> /a{4}?/ `] = lit`
(0) -> (1) : a

(1) -> (2) : a

(2) -> (3) : a

(3) -> [4] : a

[4] -> none
`;

module.exports[n`ENFA >> fromRegex >> /(a|){3}/ `] = lit`
(0) -> (1) : a
    -> (2) : ε

(1) -> (3) : ε

(2) -> (3) : ε

(3) -> (4) : a
    -> (5) : ε

(4) -> (6) : ε

(5) -> (6) : ε

(6) -> (7) : a
    -> (8) : ε

(7) -> [9] : ε

(8) -> [9] : ε

[9] -> none
`;

module.exports[n`ENFA >> fromRegex >> /(|a){3}/ `] = lit`
(0) -> (1) : ε
    -> (2) : a

(1) -> (3) : ε

(2) -> (3) : ε

(3) -> (4) : ε
    -> (5) : a

(4) -> (6) : ε

(5) -> (6) : ε

(6) -> (7) : ε
    -> (8) : a

(7) -> [9] : ε

(8) -> [9] : ε

[9] -> none
`;

module.exports[n`ENFA >> fromRegex >> /(|a|){3}/ `] = lit`
(0) -> (1) : ε
    -> (2) : a
    -> (3) : ε

(1) -> (4) : ε

(2) -> (4) : ε

(3) -> (4) : ε

(4) -> (5) : ε
    -> (6) : a
    -> (7) : ε

(5) -> (8) : ε

(6) -> (8) : ε

(7) -> (8) : ε

(8) -> (9) : ε
    -> (10) : a
    -> (11) : ε

(9) -> [12] : ε

(10) -> [12] : ε

(11) -> [12] : ε

[12] -> none
`;

module.exports[n`ENFA >> fromRegex >> /a{2,4}/ `] = lit`
(0) -> (1) : a

(1) -> (2) : a

(2) -> (3) : a
    -> [4] : ε

(3) -> (5) : a
    -> [4] : ε

[4] -> none

(5) -> [4] : ε
`;

module.exports[n`ENFA >> fromRegex >> /a{2,4}?/ `] = lit`
(0) -> (1) : a

(1) -> (2) : a

(2) -> [3] : ε
    -> (4) : a

[3] -> none

(4) -> [3] : ε
    -> (5) : a

(5) -> [3] : ε
`;

module.exports[n`ENFA >> fromRegex >> /a{2,6}/ `] = lit`
(0) -> (1) : a

(1) -> (2) : a

(2) -> (3) : a
    -> [4] : ε

(3) -> (5) : a
    -> [4] : ε

[4] -> none

(5) -> (6) : a
    -> [4] : ε

(6) -> (7) : a
    -> [4] : ε

(7) -> [4] : ε
`;

module.exports[n`ENFA >> fromRegex >> /(ab){0,3}/ `] = lit`
(0) -> (1) : a
    -> [2] : ε

(1) -> (3) : b

[2] -> none

(3) -> (4) : a
    -> [2] : ε

(4) -> (5) : b

(5) -> (6) : a
    -> [2] : ε

(6) -> (7) : b

(7) -> [2] : ε
`;

module.exports[n`ENFA >> fromRegex >> /(){100,1000}/ `] = lit`
(0) -> [1] : ε

[1] -> none
`;

module.exports[n`ENFA >> fromRegex >> /a+|/ `] = lit`
(0) -> (1) : ε
    -> (2) : ε

(1) -> (3) : a

(2) -> [4] : ε

(3) -> (1) : ε
    -> (5) : ε

[4] -> none

(5) -> [4] : ε
`;

module.exports[n`ENFA >> fromRegex >> /|a+/ `] = lit`
(0) -> (1) : ε
    -> (2) : ε

(1) -> [3] : ε

(2) -> (4) : a

[3] -> none

(4) -> (2) : ε
    -> (5) : ε

(5) -> [3] : ε
`;

module.exports[n`ENFA >> fromRegex >> /a*/ `] = lit`
(0) -> (1) : ε
    -> [2] : ε

(1) -> (3) : a

[2] -> none

(3) -> (1) : ε
    -> [2] : ε
`;

module.exports[n`ENFA >> fromRegex >> /a*?/ `] = lit`
(0) -> [1] : ε
    -> (2) : ε

[1] -> none

(2) -> (3) : a

(3) -> [1] : ε
    -> (2) : ε
`;

module.exports[n`ENFA >> fromRegex >> /(a|)+/ `] = lit`
(0) -> (1) : ε

(1) -> (2) : a
    -> (3) : ε

(2) -> (4) : ε

(3) -> (4) : ε

(4) -> (1) : ε
    -> [5] : ε

[5] -> none
`;

module.exports[n`ENFA >> fromRegex >> /(a*)+/ `] = lit`
(0) -> (1) : ε

(1) -> (2) : ε
    -> (3) : ε

(2) -> (4) : a

(3) -> (1) : ε
    -> [5] : ε

(4) -> (2) : ε
    -> (3) : ε

[5] -> none
`;

module.exports[n`ENFA >> fromRegex >> /(a*){4}/ `] = lit`
(0) -> (1) : ε
    -> (2) : ε

(1) -> (3) : a

(2) -> (4) : ε
    -> (5) : ε

(3) -> (1) : ε
    -> (2) : ε

(4) -> (6) : a

(5) -> (7) : ε
    -> (8) : ε

(6) -> (4) : ε
    -> (5) : ε

(7) -> (9) : a

(8) -> (10) : ε
    -> [11] : ε

(9) -> (7) : ε
    -> (8) : ε

(10) -> (12) : a

[11] -> none

(12) -> (10) : ε
     -> [11] : ε
`;

module.exports[n`ENFA >> fromRegex >> /(a+|){4}/ `] = lit`
(0) -> (1) : ε
    -> (2) : ε

(1) -> (3) : a

(2) -> (4) : ε

(3) -> (1) : ε
    -> (5) : ε

(4) -> (6) : ε
    -> (7) : ε

(5) -> (4) : ε

(6) -> (8) : a

(7) -> (9) : ε

(8) -> (6) : ε
    -> (10) : ε

(9) -> (11) : ε
    -> (12) : ε

(10) -> (9) : ε

(11) -> (13) : a

(12) -> (14) : ε

(13) -> (11) : ε
     -> (15) : ε

(14) -> (16) : ε
     -> (17) : ε

(15) -> (14) : ε

(16) -> (18) : a

(17) -> [19] : ε

(18) -> (16) : ε
     -> (20) : ε

[19] -> none

(20) -> [19] : ε
`;

module.exports[n`ENFA >> fromRegex >> /(a+)+/ `] = lit`
(0) -> (1) : ε

(1) -> (2) : ε

(2) -> (3) : a

(3) -> (2) : ε
    -> (4) : ε

(4) -> (1) : ε
    -> [5] : ε

[5] -> none
`;

module.exports[n`ENFA >> fromRegex >> /(a+|){0,4}/ `] = lit`
(0) -> (1) : ε
    -> (2) : ε
    -> [3] : ε

(1) -> (4) : a

(2) -> (5) : ε

[3] -> none

(4) -> (1) : ε
    -> (6) : ε

(5) -> (7) : ε
    -> (8) : ε
    -> [3] : ε

(6) -> (5) : ε

(7) -> (9) : a

(8) -> (10) : ε

(9) -> (7) : ε
    -> (11) : ε

(10) -> (12) : ε
     -> (13) : ε
     -> [3] : ε

(11) -> (10) : ε

(12) -> (14) : a

(13) -> (15) : ε

(14) -> (12) : ε
     -> (16) : ε

(15) -> (17) : ε
     -> (18) : ε
     -> [3] : ε

(16) -> (15) : ε

(17) -> (19) : a

(18) -> (20) : ε

(19) -> (17) : ε
     -> (21) : ε

(20) -> [3] : ε

(21) -> (20) : ε
`;

module.exports[n`ENFA >> fromRegex >> /(a+){4}/ `] = lit`
(0) -> (1) : ε

(1) -> (2) : a

(2) -> (1) : ε
    -> (3) : ε

(3) -> (4) : ε

(4) -> (5) : a

(5) -> (4) : ε
    -> (6) : ε

(6) -> (7) : ε

(7) -> (8) : a

(8) -> (7) : ε
    -> (9) : ε

(9) -> (10) : ε

(10) -> (11) : a

(11) -> (10) : ε
     -> [12] : ε

[12] -> none
`;

module.exports[n`ENFA >> fromRegex >> /(a*){4,}/ `] = lit`
(0) -> (1) : ε
    -> (2) : ε

(1) -> (3) : a

(2) -> (4) : ε
    -> (5) : ε

(3) -> (1) : ε
    -> (2) : ε

(4) -> (6) : a

(5) -> (7) : ε
    -> (8) : ε

(6) -> (4) : ε
    -> (5) : ε

(7) -> (9) : a

(8) -> (10) : ε

(9) -> (7) : ε
    -> (8) : ε

(10) -> (11) : ε
     -> (12) : ε

(11) -> (13) : a

(12) -> (10) : ε
     -> [14] : ε

(13) -> (11) : ε
     -> (12) : ε

[14] -> none
`;

module.exports[n`ENFA >> fromRegex >> /((a*)+)?/ `] = lit`
(0) -> (1) : ε
    -> [2] : ε

(1) -> (3) : ε
    -> (4) : ε

[2] -> none

(3) -> (5) : a

(4) -> (1) : ε
    -> (6) : ε

(5) -> (3) : ε
    -> (4) : ε

(6) -> [2] : ε
`;

module.exports[n`ENFA >> fromRegex >> /(a|b)?c/ `] = lit`
(0) -> (1) : a
    -> (2) : b
    -> (3) : ε

(1) -> (4) : ε

(2) -> (4) : ε

(3) -> [5] : c

(4) -> (3) : ε

[5] -> none
`;

module.exports[n`ENFA >> fromRegex >> /(a+|b+)*/ `] = lit`
(0) -> (1) : ε
    -> [2] : ε

(1) -> (3) : ε
    -> (4) : ε

[2] -> none

(3) -> (5) : a

(4) -> (6) : b

(5) -> (3) : ε
    -> (7) : ε

(6) -> (4) : ε
    -> (8) : ε

(7) -> (9) : ε

(8) -> (9) : ε

(9) -> (1) : ε
    -> [2] : ε
`;

module.exports[n`ENFA >> fromRegex >> /()*/ `] = lit`
(0) -> [1] : ε

[1] -> none
`;

module.exports[n`ENFA >> fromRegex >> /([^\s\S])*/ `] = lit`
(0) -> [1] : ε

[1] -> none
`;

module.exports[n`ENFA >> fromRegex >> /a*|b*/ `] = lit`
(0) -> (1) : ε
    -> (2) : ε
    -> (3) : ε
    -> (4) : ε

(1) -> (5) : a

(2) -> [6] : ε

(3) -> (7) : b

(4) -> [6] : ε

(5) -> (1) : ε
    -> (2) : ε

[6] -> none

(7) -> (3) : ε
    -> (4) : ε
`;

module.exports[n`ENFA >> fromRegex >> /a+|b+|c+/ `] = lit`
(0) -> (1) : ε
    -> (2) : ε
    -> (3) : ε

(1) -> (4) : a

(2) -> (5) : b

(3) -> (6) : c

(4) -> (1) : ε
    -> (7) : ε

(5) -> (2) : ε
    -> (8) : ε

(6) -> (3) : ε
    -> (9) : ε

(7) -> [10] : ε

(8) -> [10] : ε

(9) -> [10] : ε

[10] -> none
`;

module.exports[n`ENFA >> fromRegex >> /(a*|b*)+/ `] = lit`
(0) -> (1) : ε

(1) -> (2) : ε
    -> (3) : ε
    -> (4) : ε
    -> (5) : ε

(2) -> (6) : a

(3) -> (7) : ε

(4) -> (8) : b

(5) -> (7) : ε

(6) -> (2) : ε
    -> (3) : ε

(7) -> (1) : ε
    -> [9] : ε

(8) -> (4) : ε
    -> (5) : ε

[9] -> none
`;

module.exports[n`ENFA >> fromRegex >> /[^\s\S]/ `] = lit`
(0) -> none
`;

module.exports[n`ENFA >> fromRegex >> /ab[^\s\S]ba/ `] = lit`
(0) -> none
`;

module.exports[n`ENFA >> fromRegex >> /([^\s\S]|a|[^\s\S]|b[^\s\S]b|[^\s\S])a/ `] = lit`
(0) -> (1) : a

(1) -> [2] : a

[2] -> none
`;

module.exports[n`ENFA >> fromRegex >> /[^\s\S]+/ `] = lit`
(0) -> none
`;

module.exports[n`ENFA >> fromRegex >> /[^\s\S]*/ `] = lit`
(0) -> [1] : ε

[1] -> none
`;

module.exports[n`ENFA >> fromRegex >> /[^\s\S]?/ `] = lit`
(0) -> [1] : ε

[1] -> none
`;

module.exports[n`ENFA >> fromRegex >> /a+|aaab/ `] = lit`
(0) -> (1) : ε
    -> (2) : a

(1) -> (3) : a

(2) -> (4) : a

(3) -> (1) : ε
    -> (5) : ε

(4) -> (6) : a

(5) -> [7] : ε

(6) -> (8) : b

[7] -> none

(8) -> [7] : ε
`;

module.exports[n`ENFA >> fromRegex >> /a+|a*aa*/ `] = lit`
(0) -> (1) : ε
    -> (2) : ε
    -> (3) : ε

(1) -> (4) : a

(2) -> (5) : a

(3) -> (6) : a

(4) -> (1) : ε
    -> (7) : ε

(5) -> (2) : ε
    -> (3) : ε

(6) -> (8) : ε
    -> (9) : ε

(7) -> [10] : ε

(8) -> (11) : a

(9) -> [10] : ε

[10] -> none

(11) -> (8) : ε
     -> (9) : ε
`;

module.exports[n`ENFA >> fromRegex >> /(?:a+){2,}/ `] = lit`
(0) -> (1) : ε

(1) -> (2) : a

(2) -> (1) : ε
    -> (3) : ε

(3) -> (4) : ε

(4) -> (5) : ε

(5) -> (6) : a

(6) -> (5) : ε
    -> (7) : ε

(7) -> (4) : ε
    -> [8] : ε

[8] -> none
`;

module.exports[n`ENFA >> fromRegex >> /abc|ab|abd|abcd/ `] = lit`
(0) -> (1) : a
    -> (2) : a
    -> (3) : a
    -> (4) : a

(1) -> (5) : b

(2) -> (6) : b

(3) -> (7) : b

(4) -> (8) : b

(5) -> (9) : c

(6) -> [10] : ε

(7) -> (11) : d

(8) -> (12) : c

(9) -> [10] : ε

[10] -> none

(11) -> [10] : ε

(12) -> (13) : d

(13) -> [10] : ε
`;

module.exports[n`ENFA >> fromRegex >> /abc?|abd|abcd/ `] = lit`
(0) -> (1) : a
    -> (2) : a
    -> (3) : a

(1) -> (4) : b

(2) -> (5) : b

(3) -> (6) : b

(4) -> (7) : c
    -> (8) : ε

(5) -> (9) : d

(6) -> (10) : c

(7) -> (8) : ε

(8) -> [11] : ε

(9) -> [11] : ε

(10) -> (12) : d

[11] -> none

(12) -> [11] : ε
`;

module.exports[n`ENFA >> fromRegex >> /food|fool|foot/ `] = lit`
(0) -> (1) : f
    -> (2) : f
    -> (3) : f

(1) -> (4) : o

(2) -> (5) : o

(3) -> (6) : o

(4) -> (7) : o

(5) -> (8) : o

(6) -> (9) : o

(7) -> (10) : d

(8) -> (11) : l

(9) -> (12) : t

(10) -> [13] : ε

(11) -> [13] : ε

(12) -> [13] : ε

[13] -> none
`;

module.exports[n`ENFA >> fromRegex >> /fo(od|ol|ot)/ `] = lit`
(0) -> (1) : f

(1) -> (2) : o

(2) -> (3) : o
    -> (4) : o
    -> (5) : o

(3) -> (6) : d

(4) -> (7) : l

(5) -> (8) : t

(6) -> [9] : ε

(7) -> [9] : ε

(8) -> [9] : ε

[9] -> none
`;

module.exports[n`ENFA >> fromRegex >> /bet|get|pet|set/ `] = lit`
(0) -> (1) : b
    -> (2) : g
    -> (3) : p
    -> (4) : s

(1) -> (5) : e

(2) -> (6) : e

(3) -> (7) : e

(4) -> (8) : e

(5) -> (9) : t

(6) -> (10) : t

(7) -> (11) : t

(8) -> (12) : t

(9) -> [13] : ε

(10) -> [13] : ε

(11) -> [13] : ε

(12) -> [13] : ε

[13] -> none
`;

module.exports[n`ENFA >> fromRegex >> /bet|bat|bit/ `] = lit`
(0) -> (1) : b
    -> (2) : b
    -> (3) : b

(1) -> (4) : e

(2) -> (5) : a

(3) -> (6) : i

(4) -> (7) : t

(5) -> (8) : t

(6) -> (9) : t

(7) -> [10] : ε

(8) -> [10] : ε

(9) -> [10] : ε

[10] -> none
`;

module.exports[n`ENFA >> fromRegex >> /a(?:bc)?|dbc/ `] = lit`
(0) -> (1) : a
    -> (2) : d

(1) -> (3) : b
    -> (4) : ε

(2) -> (5) : b

(3) -> (6) : c

(4) -> [7] : ε

(5) -> (8) : c

(6) -> (4) : ε

[7] -> none

(8) -> [7] : ε
`;

module.exports[n`ENFA >> fromRegex >> /\d+(?:\.\d+)?(?:e[+-]?\d+)?/i `] = lit`
(0) -> (1) : ε

(1) -> (2) : 0-9

(2) -> (1) : ε
    -> (3) : ε

(3) -> (4) : '.'
    -> (5) : ε

(4) -> (6) : ε

(5) -> (7) : E e
    -> [8] : ε

(6) -> (9) : 0-9

(7) -> (10) : '+' '-'
    -> (11) : ε

[8] -> none

(9) -> (6) : ε
    -> (12) : ε

(10) -> (11) : ε

(11) -> (13) : ε

(12) -> (5) : ε

(13) -> (14) : 0-9

(14) -> (13) : ε
     -> (15) : ε

(15) -> [8] : ε
`;

module.exports[n`ENFA >> fromRegex >> /<[=>]?|>=?|=>?|:=|\/=?/ `] = lit`
(0) -> (1) : '<'
    -> (2) : '>'
    -> (3) : '='
    -> (4) : ':'
    -> (5) : '/'

(1) -> (6) : '=' '>'
    -> (7) : ε

(2) -> (8) : '='
    -> (9) : ε

(3) -> (10) : '>'
    -> (11) : ε

(4) -> (12) : '='

(5) -> (13) : '='
    -> (14) : ε

(6) -> (7) : ε

(7) -> [15] : ε

(8) -> (9) : ε

(9) -> [15] : ε

(10) -> (11) : ε

(11) -> [15] : ε

(12) -> [15] : ε

(13) -> (14) : ε

(14) -> [15] : ε

[15] -> none
`;

module.exports[n`ENFA >> fromRegex >> /\{[^\r\n}:]+\}/ `] = lit`
(0) -> (1) : '{'

(1) -> (2) : ε

(2) -> (3) : not U+A U+D ':' '}'

(3) -> (2) : ε
    -> (4) : ε

(4) -> [5] : '}'

[5] -> none
`;

module.exports[n`ENFA >> fromRegex >> /'(?:%.|[^%'\r\n])+'/ `] = lit`
(0) -> (1) : '''

(1) -> (2) : ε

(2) -> (3) : '%'
    -> (4) : not U+A U+D '%' '''

(3) -> (5) : not U+A U+D U+2028 U+2029

(4) -> (6) : ε

(5) -> (6) : ε

(6) -> (2) : ε
    -> (7) : ε

(7) -> [8] : '''

[8] -> none
`;

module.exports[n`ENFA >> fromRegex >> /&[bchou][a-z\d]+/i `] = lit`
(0) -> (1) : '&'

(1) -> (2) : B C H O U b c h o u

(2) -> (3) : ε

(3) -> (4) : 0-9 A-Z a-z

(4) -> (3) : ε
    -> [5] : ε

[5] -> none
`;

module.exports[n`ENFA >> fromRegex >> /"(?:[^\\"]|\\.)*"|'[^']*'/ `] = lit`
(0) -> (1) : '"'
    -> (2) : '''

(1) -> (3) : ε
    -> (4) : ε

(2) -> (5) : ε
    -> (6) : ε

(3) -> (7) : not '"' '\'
    -> (8) : '\'

(4) -> (9) : '"'

(5) -> (10) : not '''

(6) -> (11) : '''

(7) -> (12) : ε

(8) -> (13) : not U+A U+D U+2028 U+2029

(9) -> [14] : ε

(10) -> (5) : ε
     -> (6) : ε

(11) -> [14] : ε

(12) -> (3) : ε
     -> (4) : ε

(13) -> (12) : ε

[14] -> none
`;

module.exports[n`ENFA >> fromRegex options >> {"assertions":"disable"}: /^foo$|bar/ `] = lit`
(0) -> (1) : b

(1) -> (2) : a

(2) -> (3) : r

(3) -> [4] : ε

[4] -> none
`;

module.exports[n`ENFA >> fromRegex options >> {"assertions":"ignore"}: /^foo$|bar/ `] = lit`
(0) -> (1) : ε
    -> (2) : b

(1) -> (3) : f

(2) -> (4) : a

(3) -> (5) : o

(4) -> (6) : r

(5) -> (7) : o

(6) -> [8] : ε

(7) -> (9) : ε

[8] -> none

(9) -> [8] : ε
`;

module.exports[n`ENFA >> union >> /()/ ∪ /()/ (left) `] = lit`
(0) -> (1) : ε
    -> (2) : ε

(1) -> (3) : ε

(2) -> (4) : ε

(3) -> [5] : ε

(4) -> [5] : ε

[5] -> none
`;

module.exports[n`ENFA >> union >> /()/ ∪ /()/ (right) `] = lit`
(0) -> [1] : ε
    -> (2) : ε

[1] -> none

(2) -> (3) : ε

(3) -> [1] : ε
`;

module.exports[n`ENFA >> union >> /()/ ∪ /b/ (left) `] = lit`
(0) -> (1) : ε
    -> (2) : ε

(1) -> (3) : b

(2) -> (4) : ε

(3) -> [5] : ε

(4) -> [5] : ε

[5] -> none
`;

module.exports[n`ENFA >> union >> /()/ ∪ /b/ (right) `] = lit`
(0) -> [1] : ε
    -> (2) : ε

[1] -> none

(2) -> (3) : b

(3) -> [1] : ε
`;

module.exports[n`ENFA >> union >> /()/ ∪ /b?/ (left) `] = lit`
(0) -> (1) : ε
    -> (2) : ε

(1) -> (3) : b
    -> (4) : ε

(2) -> (5) : ε

(3) -> (4) : ε

(4) -> [6] : ε

(5) -> [6] : ε

[6] -> none
`;

module.exports[n`ENFA >> union >> /()/ ∪ /b?/ (right) `] = lit`
(0) -> [1] : ε
    -> (2) : ε

[1] -> none

(2) -> (3) : b
    -> (4) : ε

(3) -> (4) : ε

(4) -> [1] : ε
`;

module.exports[n`ENFA >> union >> /()/ ∪ /b*/ (left) `] = lit`
(0) -> (1) : ε
    -> (2) : ε

(1) -> (3) : ε
    -> (4) : ε

(2) -> (5) : ε

(3) -> (6) : b

(4) -> [7] : ε

(5) -> [7] : ε

(6) -> (3) : ε
    -> (4) : ε

[7] -> none
`;

module.exports[n`ENFA >> union >> /()/ ∪ /b*/ (right) `] = lit`
(0) -> [1] : ε
    -> (2) : ε

[1] -> none

(2) -> (3) : ε
    -> (4) : ε

(3) -> (5) : b

(4) -> [1] : ε

(5) -> (3) : ε
    -> (4) : ε
`;

module.exports[n`ENFA >> union >> /()/ ∪ /b+/ (left) `] = lit`
(0) -> (1) : ε
    -> (2) : ε

(1) -> (3) : ε

(2) -> (4) : ε

(3) -> (5) : b

(4) -> [6] : ε

(5) -> (3) : ε
    -> (7) : ε

[6] -> none

(7) -> [6] : ε
`;

module.exports[n`ENFA >> union >> /()/ ∪ /b+/ (right) `] = lit`
(0) -> [1] : ε
    -> (2) : ε

[1] -> none

(2) -> (3) : ε

(3) -> (4) : b

(4) -> (3) : ε
    -> (5) : ε

(5) -> [1] : ε
`;

module.exports[n`ENFA >> union >> /a/ ∪ /()/ (left) `] = lit`
(0) -> (1) : ε
    -> (2) : ε

(1) -> (3) : ε

(2) -> (4) : a

(3) -> [5] : ε

(4) -> [5] : ε

[5] -> none
`;

module.exports[n`ENFA >> union >> /a/ ∪ /()/ (right) `] = lit`
(0) -> [1] : a
    -> (2) : ε

[1] -> none

(2) -> (3) : ε

(3) -> [1] : ε
`;

module.exports[n`ENFA >> union >> /a/ ∪ /b/ (left) `] = lit`
(0) -> (1) : ε
    -> (2) : ε

(1) -> (3) : b

(2) -> (4) : a

(3) -> [5] : ε

(4) -> [5] : ε

[5] -> none
`;

module.exports[n`ENFA >> union >> /a/ ∪ /b/ (right) `] = lit`
(0) -> [1] : a
    -> (2) : ε

[1] -> none

(2) -> (3) : b

(3) -> [1] : ε
`;

module.exports[n`ENFA >> union >> /a/ ∪ /b?/ (left) `] = lit`
(0) -> (1) : ε
    -> (2) : ε

(1) -> (3) : b
    -> (4) : ε

(2) -> (5) : a

(3) -> (4) : ε

(4) -> [6] : ε

(5) -> [6] : ε

[6] -> none
`;

module.exports[n`ENFA >> union >> /a/ ∪ /b?/ (right) `] = lit`
(0) -> [1] : a
    -> (2) : ε

[1] -> none

(2) -> (3) : b
    -> (4) : ε

(3) -> (4) : ε

(4) -> [1] : ε
`;

module.exports[n`ENFA >> union >> /a/ ∪ /b*/ (left) `] = lit`
(0) -> (1) : ε
    -> (2) : ε

(1) -> (3) : ε
    -> (4) : ε

(2) -> (5) : a

(3) -> (6) : b

(4) -> [7] : ε

(5) -> [7] : ε

(6) -> (3) : ε
    -> (4) : ε

[7] -> none
`;

module.exports[n`ENFA >> union >> /a/ ∪ /b*/ (right) `] = lit`
(0) -> [1] : a
    -> (2) : ε

[1] -> none

(2) -> (3) : ε
    -> (4) : ε

(3) -> (5) : b

(4) -> [1] : ε

(5) -> (3) : ε
    -> (4) : ε
`;

module.exports[n`ENFA >> union >> /a/ ∪ /b+/ (left) `] = lit`
(0) -> (1) : ε
    -> (2) : ε

(1) -> (3) : ε

(2) -> (4) : a

(3) -> (5) : b

(4) -> [6] : ε

(5) -> (3) : ε
    -> (7) : ε

[6] -> none

(7) -> [6] : ε
`;

module.exports[n`ENFA >> union >> /a/ ∪ /b+/ (right) `] = lit`
(0) -> [1] : a
    -> (2) : ε

[1] -> none

(2) -> (3) : ε

(3) -> (4) : b

(4) -> (3) : ε
    -> (5) : ε

(5) -> [1] : ε
`;

module.exports[n`ENFA >> union >> /a?/ ∪ /()/ (left) `] = lit`
(0) -> (1) : ε
    -> (2) : ε

(1) -> (3) : ε

(2) -> (4) : a
    -> (5) : ε

(3) -> [6] : ε

(4) -> (5) : ε

(5) -> [6] : ε

[6] -> none
`;

module.exports[n`ENFA >> union >> /a?/ ∪ /()/ (right) `] = lit`
(0) -> (1) : a
    -> [2] : ε
    -> (3) : ε

(1) -> [2] : ε

[2] -> none

(3) -> (4) : ε

(4) -> [2] : ε
`;

module.exports[n`ENFA >> union >> /a?/ ∪ /b/ (left) `] = lit`
(0) -> (1) : ε
    -> (2) : ε

(1) -> (3) : b

(2) -> (4) : a
    -> (5) : ε

(3) -> [6] : ε

(4) -> (5) : ε

(5) -> [6] : ε

[6] -> none
`;

module.exports[n`ENFA >> union >> /a?/ ∪ /b/ (right) `] = lit`
(0) -> (1) : a
    -> [2] : ε
    -> (3) : ε

(1) -> [2] : ε

[2] -> none

(3) -> (4) : b

(4) -> [2] : ε
`;

module.exports[n`ENFA >> union >> /a?/ ∪ /b?/ (left) `] = lit`
(0) -> (1) : ε
    -> (2) : ε

(1) -> (3) : b
    -> (4) : ε

(2) -> (5) : a
    -> (6) : ε

(3) -> (4) : ε

(4) -> [7] : ε

(5) -> (6) : ε

(6) -> [7] : ε

[7] -> none
`;

module.exports[n`ENFA >> union >> /a?/ ∪ /b?/ (right) `] = lit`
(0) -> (1) : a
    -> [2] : ε
    -> (3) : ε

(1) -> [2] : ε

[2] -> none

(3) -> (4) : b
    -> (5) : ε

(4) -> (5) : ε

(5) -> [2] : ε
`;

module.exports[n`ENFA >> union >> /a?/ ∪ /b*/ (left) `] = lit`
(0) -> (1) : ε
    -> (2) : ε

(1) -> (3) : ε
    -> (4) : ε

(2) -> (5) : a
    -> (6) : ε

(3) -> (7) : b

(4) -> [8] : ε

(5) -> (6) : ε

(6) -> [8] : ε

(7) -> (3) : ε
    -> (4) : ε

[8] -> none
`;

module.exports[n`ENFA >> union >> /a?/ ∪ /b*/ (right) `] = lit`
(0) -> (1) : a
    -> [2] : ε
    -> (3) : ε

(1) -> [2] : ε

[2] -> none

(3) -> (4) : ε
    -> (5) : ε

(4) -> (6) : b

(5) -> [2] : ε

(6) -> (4) : ε
    -> (5) : ε
`;

module.exports[n`ENFA >> union >> /a?/ ∪ /b+/ (left) `] = lit`
(0) -> (1) : ε
    -> (2) : ε

(1) -> (3) : ε

(2) -> (4) : a
    -> (5) : ε

(3) -> (6) : b

(4) -> (5) : ε

(5) -> [7] : ε

(6) -> (3) : ε
    -> (8) : ε

[7] -> none

(8) -> [7] : ε
`;

module.exports[n`ENFA >> union >> /a?/ ∪ /b+/ (right) `] = lit`
(0) -> (1) : a
    -> [2] : ε
    -> (3) : ε

(1) -> [2] : ε

[2] -> none

(3) -> (4) : ε

(4) -> (5) : b

(5) -> (4) : ε
    -> (6) : ε

(6) -> [2] : ε
`;

module.exports[n`ENFA >> union >> /a*/ ∪ /()/ (left) `] = lit`
(0) -> (1) : ε
    -> (2) : ε

(1) -> (3) : ε

(2) -> (4) : ε
    -> (5) : ε

(3) -> [6] : ε

(4) -> (7) : a

(5) -> [6] : ε

[6] -> none

(7) -> (4) : ε
    -> (5) : ε
`;

module.exports[n`ENFA >> union >> /a*/ ∪ /()/ (right) `] = lit`
(0) -> (1) : ε
    -> [2] : ε
    -> (3) : ε

(1) -> (4) : a

[2] -> none

(3) -> (5) : ε

(4) -> (1) : ε
    -> [2] : ε

(5) -> [2] : ε
`;

module.exports[n`ENFA >> union >> /a*/ ∪ /b/ (left) `] = lit`
(0) -> (1) : ε
    -> (2) : ε

(1) -> (3) : b

(2) -> (4) : ε
    -> (5) : ε

(3) -> [6] : ε

(4) -> (7) : a

(5) -> [6] : ε

[6] -> none

(7) -> (4) : ε
    -> (5) : ε
`;

module.exports[n`ENFA >> union >> /a*/ ∪ /b/ (right) `] = lit`
(0) -> (1) : ε
    -> [2] : ε
    -> (3) : ε

(1) -> (4) : a

[2] -> none

(3) -> (5) : b

(4) -> (1) : ε
    -> [2] : ε

(5) -> [2] : ε
`;

module.exports[n`ENFA >> union >> /a*/ ∪ /b?/ (left) `] = lit`
(0) -> (1) : ε
    -> (2) : ε

(1) -> (3) : b
    -> (4) : ε

(2) -> (5) : ε
    -> (6) : ε

(3) -> (4) : ε

(4) -> [7] : ε

(5) -> (8) : a

(6) -> [7] : ε

[7] -> none

(8) -> (5) : ε
    -> (6) : ε
`;

module.exports[n`ENFA >> union >> /a*/ ∪ /b?/ (right) `] = lit`
(0) -> (1) : ε
    -> [2] : ε
    -> (3) : ε

(1) -> (4) : a

[2] -> none

(3) -> (5) : b
    -> (6) : ε

(4) -> (1) : ε
    -> [2] : ε

(5) -> (6) : ε

(6) -> [2] : ε
`;

module.exports[n`ENFA >> union >> /a*/ ∪ /b*/ (left) `] = lit`
(0) -> (1) : ε
    -> (2) : ε

(1) -> (3) : ε
    -> (4) : ε

(2) -> (5) : ε
    -> (6) : ε

(3) -> (7) : b

(4) -> [8] : ε

(5) -> (9) : a

(6) -> [8] : ε

(7) -> (3) : ε
    -> (4) : ε

[8] -> none

(9) -> (5) : ε
    -> (6) : ε
`;

module.exports[n`ENFA >> union >> /a*/ ∪ /b*/ (right) `] = lit`
(0) -> (1) : ε
    -> [2] : ε
    -> (3) : ε

(1) -> (4) : a

[2] -> none

(3) -> (5) : ε
    -> (6) : ε

(4) -> (1) : ε
    -> [2] : ε

(5) -> (7) : b

(6) -> [2] : ε

(7) -> (5) : ε
    -> (6) : ε
`;

module.exports[n`ENFA >> union >> /a*/ ∪ /b+/ (left) `] = lit`
(0) -> (1) : ε
    -> (2) : ε

(1) -> (3) : ε

(2) -> (4) : ε
    -> (5) : ε

(3) -> (6) : b

(4) -> (7) : a

(5) -> [8] : ε

(6) -> (3) : ε
    -> (9) : ε

(7) -> (4) : ε
    -> (5) : ε

[8] -> none

(9) -> [8] : ε
`;

module.exports[n`ENFA >> union >> /a*/ ∪ /b+/ (right) `] = lit`
(0) -> (1) : ε
    -> [2] : ε
    -> (3) : ε

(1) -> (4) : a

[2] -> none

(3) -> (5) : ε

(4) -> (1) : ε
    -> [2] : ε

(5) -> (6) : b

(6) -> (5) : ε
    -> (7) : ε

(7) -> [2] : ε
`;

module.exports[n`ENFA >> union >> /a+/ ∪ /()/ (left) `] = lit`
(0) -> (1) : ε
    -> (2) : ε

(1) -> (3) : ε

(2) -> (4) : ε

(3) -> [5] : ε

(4) -> (6) : a

[5] -> none

(6) -> (4) : ε
    -> (7) : ε

(7) -> [5] : ε
`;

module.exports[n`ENFA >> union >> /a+/ ∪ /()/ (right) `] = lit`
(0) -> (1) : ε
    -> (2) : ε

(1) -> (3) : a

(2) -> (4) : ε

(3) -> (1) : ε
    -> [5] : ε

(4) -> [5] : ε

[5] -> none
`;

module.exports[n`ENFA >> union >> /a+/ ∪ /b/ (left) `] = lit`
(0) -> (1) : ε
    -> (2) : ε

(1) -> (3) : b

(2) -> (4) : ε

(3) -> [5] : ε

(4) -> (6) : a

[5] -> none

(6) -> (4) : ε
    -> (7) : ε

(7) -> [5] : ε
`;

module.exports[n`ENFA >> union >> /a+/ ∪ /b/ (right) `] = lit`
(0) -> (1) : ε
    -> (2) : ε

(1) -> (3) : a

(2) -> (4) : b

(3) -> (1) : ε
    -> [5] : ε

(4) -> [5] : ε

[5] -> none
`;

module.exports[n`ENFA >> union >> /a+/ ∪ /b?/ (left) `] = lit`
(0) -> (1) : ε
    -> (2) : ε

(1) -> (3) : b
    -> (4) : ε

(2) -> (5) : ε

(3) -> (4) : ε

(4) -> [6] : ε

(5) -> (7) : a

[6] -> none

(7) -> (5) : ε
    -> (8) : ε

(8) -> [6] : ε
`;

module.exports[n`ENFA >> union >> /a+/ ∪ /b?/ (right) `] = lit`
(0) -> (1) : ε
    -> (2) : ε

(1) -> (3) : a

(2) -> (4) : b
    -> (5) : ε

(3) -> (1) : ε
    -> [6] : ε

(4) -> (5) : ε

(5) -> [6] : ε

[6] -> none
`;

module.exports[n`ENFA >> union >> /a+/ ∪ /b*/ (left) `] = lit`
(0) -> (1) : ε
    -> (2) : ε

(1) -> (3) : ε
    -> (4) : ε

(2) -> (5) : ε

(3) -> (6) : b

(4) -> [7] : ε

(5) -> (8) : a

(6) -> (3) : ε
    -> (4) : ε

[7] -> none

(8) -> (5) : ε
    -> (9) : ε

(9) -> [7] : ε
`;

module.exports[n`ENFA >> union >> /a+/ ∪ /b*/ (right) `] = lit`
(0) -> (1) : ε
    -> (2) : ε

(1) -> (3) : a

(2) -> (4) : ε
    -> (5) : ε

(3) -> (1) : ε
    -> [6] : ε

(4) -> (7) : b

(5) -> [6] : ε

[6] -> none

(7) -> (4) : ε
    -> (5) : ε
`;

module.exports[n`ENFA >> union >> /a+/ ∪ /b+/ (left) `] = lit`
(0) -> (1) : ε
    -> (2) : ε

(1) -> (3) : ε

(2) -> (4) : ε

(3) -> (5) : b

(4) -> (6) : a

(5) -> (3) : ε
    -> (7) : ε

(6) -> (4) : ε
    -> (8) : ε

(7) -> [9] : ε

(8) -> [9] : ε

[9] -> none
`;

module.exports[n`ENFA >> union >> /a+/ ∪ /b+/ (right) `] = lit`
(0) -> (1) : ε
    -> (2) : ε

(1) -> (3) : a

(2) -> (4) : ε

(3) -> (1) : ε
    -> [5] : ε

(4) -> (6) : b

[5] -> none

(6) -> (4) : ε
    -> (7) : ε

(7) -> [5] : ε
`;

module.exports[n`ENFA >> union >> /ab/ ∪ /ba/ (left) `] = lit`
(0) -> (1) : ε
    -> (2) : ε

(1) -> (3) : b

(2) -> (4) : a

(3) -> (5) : a

(4) -> (6) : b

(5) -> [7] : ε

(6) -> [7] : ε

[7] -> none
`;

module.exports[n`ENFA >> union >> /ab/ ∪ /ba/ (right) `] = lit`
(0) -> (1) : a
    -> (2) : ε

(1) -> [3] : b

(2) -> (4) : b

[3] -> none

(4) -> (5) : a

(5) -> [3] : ε
`;

module.exports[n`ENFA >> union >> /foo/ ∪ /bar/ (left) `] = lit`
(0) -> (1) : ε
    -> (2) : ε

(1) -> (3) : b

(2) -> (4) : f

(3) -> (5) : a

(4) -> (6) : o

(5) -> (7) : r

(6) -> (8) : o

(7) -> [9] : ε

(8) -> [9] : ε

[9] -> none
`;

module.exports[n`ENFA >> union >> /foo/ ∪ /bar/ (right) `] = lit`
(0) -> (1) : f
    -> (2) : ε

(1) -> (3) : o

(2) -> (4) : b

(3) -> [5] : o

(4) -> (6) : a

[5] -> none

(6) -> (7) : r

(7) -> [5] : ε
`;

module.exports[n`ENFA >> union >> /a/ ∪ /a*/ (left) `] = lit`
(0) -> (1) : ε
    -> (2) : ε

(1) -> (3) : ε
    -> (4) : ε

(2) -> (5) : a

(3) -> (6) : a

(4) -> [7] : ε

(5) -> [7] : ε

(6) -> (3) : ε
    -> (4) : ε

[7] -> none
`;

module.exports[n`ENFA >> union >> /a/ ∪ /a*/ (right) `] = lit`
(0) -> [1] : a
    -> (2) : ε

[1] -> none

(2) -> (3) : ε
    -> (4) : ε

(3) -> (5) : a

(4) -> [1] : ε

(5) -> (3) : ε
    -> (4) : ε
`;

module.exports[n`ENFA >> union >> /a*/ ∪ /a*b*c*/ (left) `] = lit`
(0) -> (1) : ε
    -> (2) : ε

(1) -> (3) : ε
    -> (4) : ε

(2) -> (5) : ε
    -> (6) : ε

(3) -> (7) : a

(4) -> (8) : ε
    -> (9) : ε

(5) -> (10) : a

(6) -> [11] : ε

(7) -> (3) : ε
    -> (4) : ε

(8) -> (12) : b

(9) -> (13) : ε
    -> (14) : ε

(10) -> (5) : ε
     -> (6) : ε

[11] -> none

(12) -> (8) : ε
     -> (9) : ε

(13) -> (15) : c

(14) -> [11] : ε

(15) -> (13) : ε
     -> (14) : ε
`;

module.exports[n`ENFA >> union >> /a*/ ∪ /a*b*c*/ (right) `] = lit`
(0) -> (1) : ε
    -> [2] : ε
    -> (3) : ε

(1) -> (4) : a

[2] -> none

(3) -> (5) : ε
    -> (6) : ε

(4) -> (1) : ε
    -> [2] : ε

(5) -> (7) : a

(6) -> (8) : ε
    -> (9) : ε

(7) -> (5) : ε
    -> (6) : ε

(8) -> (10) : b

(9) -> (11) : ε
    -> (12) : ε

(10) -> (8) : ε
     -> (9) : ε

(11) -> (13) : c

(12) -> [2] : ε

(13) -> (11) : ε
     -> (12) : ε
`;

module.exports[n`ENFA >> union >> /a|b|c{2}/ ∪ /a{2}|b{2}|c/ (left) `] = lit`
(0) -> (1) : ε
    -> (2) : ε

(1) -> (3) : a
    -> (4) : b
    -> (5) : c

(2) -> (6) : a
    -> (7) : b
    -> (8) : c

(3) -> (9) : a

(4) -> (10) : b

(5) -> (11) : ε

(6) -> (12) : ε

(7) -> (12) : ε

(8) -> (13) : c

(9) -> (11) : ε

(10) -> (11) : ε

(11) -> [14] : ε

(12) -> [14] : ε

(13) -> (12) : ε

[14] -> none
`;

module.exports[n`ENFA >> union >> /a|b|c{2}/ ∪ /a{2}|b{2}|c/ (right) `] = lit`
(0) -> (1) : a
    -> (2) : b
    -> (3) : c
    -> (4) : ε

(1) -> [5] : ε

(2) -> [5] : ε

(3) -> (6) : c

(4) -> (7) : a
    -> (8) : b
    -> (9) : c

[5] -> none

(6) -> [5] : ε

(7) -> (10) : a

(8) -> (11) : b

(9) -> (12) : ε

(10) -> (12) : ε

(11) -> (12) : ε

(12) -> [5] : ε
`;

module.exports[n`ENFA >> union >> /ba/ ∪ /ab/ (left) `] = lit`
(0) -> (1) : ε
    -> (2) : ε

(1) -> (3) : a

(2) -> (4) : b

(3) -> (5) : b

(4) -> (6) : a

(5) -> [7] : ε

(6) -> [7] : ε

[7] -> none
`;

module.exports[n`ENFA >> union >> /ba/ ∪ /ab/ (right) `] = lit`
(0) -> (1) : b
    -> (2) : ε

(1) -> [3] : a

(2) -> (4) : a

[3] -> none

(4) -> (5) : b

(5) -> [3] : ε
`;

module.exports[n`ENFA >> union >> /bar/ ∪ /foo/ (left) `] = lit`
(0) -> (1) : ε
    -> (2) : ε

(1) -> (3) : f

(2) -> (4) : b

(3) -> (5) : o

(4) -> (6) : a

(5) -> (7) : o

(6) -> (8) : r

(7) -> [9] : ε

(8) -> [9] : ε

[9] -> none
`;

module.exports[n`ENFA >> union >> /bar/ ∪ /foo/ (right) `] = lit`
(0) -> (1) : b
    -> (2) : ε

(1) -> (3) : a

(2) -> (4) : f

(3) -> [5] : r

(4) -> (6) : o

[5] -> none

(6) -> (7) : o

(7) -> [5] : ε
`;

module.exports[n`ENFA >> union >> /a*/ ∪ /a/ (left) `] = lit`
(0) -> (1) : ε
    -> (2) : ε

(1) -> (3) : a

(2) -> (4) : ε
    -> (5) : ε

(3) -> [6] : ε

(4) -> (7) : a

(5) -> [6] : ε

[6] -> none

(7) -> (4) : ε
    -> (5) : ε
`;

module.exports[n`ENFA >> union >> /a*/ ∪ /a/ (right) `] = lit`
(0) -> (1) : ε
    -> [2] : ε
    -> (3) : ε

(1) -> (4) : a

[2] -> none

(3) -> (5) : a

(4) -> (1) : ε
    -> [2] : ε

(5) -> [2] : ε
`;

module.exports[n`ENFA >> union >> /a*b*c*/ ∪ /a*/ (left) `] = lit`
(0) -> (1) : ε
    -> (2) : ε

(1) -> (3) : ε
    -> (4) : ε

(2) -> (5) : ε
    -> (6) : ε

(3) -> (7) : a

(4) -> [8] : ε

(5) -> (9) : a

(6) -> (10) : ε
    -> (11) : ε

(7) -> (3) : ε
    -> (4) : ε

[8] -> none

(9) -> (5) : ε
    -> (6) : ε

(10) -> (12) : b

(11) -> (13) : ε
     -> (14) : ε

(12) -> (10) : ε
     -> (11) : ε

(13) -> (15) : c

(14) -> [8] : ε

(15) -> (13) : ε
     -> (14) : ε
`;

module.exports[n`ENFA >> union >> /a*b*c*/ ∪ /a*/ (right) `] = lit`
(0) -> (1) : ε
    -> (2) : ε
    -> (3) : ε

(1) -> (4) : a

(2) -> (5) : ε
    -> (6) : ε

(3) -> (7) : ε
    -> (8) : ε

(4) -> (1) : ε
    -> (2) : ε

(5) -> (9) : b

(6) -> (10) : ε
    -> [11] : ε

(7) -> (12) : a

(8) -> [11] : ε

(9) -> (5) : ε
    -> (6) : ε

(10) -> (13) : c

[11] -> none

(12) -> (7) : ε
     -> (8) : ε

(13) -> (10) : ε
     -> [11] : ε
`;

module.exports[n`ENFA >> union >> /a{2}|b{2}|c/ ∪ /a|b|c{2}/ (left) `] = lit`
(0) -> (1) : ε
    -> (2) : ε

(1) -> (3) : a
    -> (4) : b
    -> (5) : c

(2) -> (6) : a
    -> (7) : b
    -> (8) : c

(3) -> (9) : ε

(4) -> (9) : ε

(5) -> (10) : c

(6) -> (11) : a

(7) -> (12) : b

(8) -> (13) : ε

(9) -> [14] : ε

(10) -> (9) : ε

(11) -> (13) : ε

(12) -> (13) : ε

(13) -> [14] : ε

[14] -> none
`;

module.exports[n`ENFA >> union >> /a{2}|b{2}|c/ ∪ /a|b|c{2}/ (right) `] = lit`
(0) -> (1) : a
    -> (2) : b
    -> (3) : c
    -> (4) : ε

(1) -> (5) : a

(2) -> (6) : b

(3) -> [7] : ε

(4) -> (8) : a
    -> (9) : b
    -> (10) : c

(5) -> [7] : ε

(6) -> [7] : ε

[7] -> none

(8) -> (11) : ε

(9) -> (11) : ε

(10) -> (12) : c

(11) -> [7] : ε

(12) -> (11) : ε
`;

module.exports[n`ENFA >> append >> /()/ * /()/ `] = lit`
(0) -> (1) : ε

(1) -> (2) : ε

(2) -> [3] : ε

[3] -> none
`;

module.exports[n`ENFA >> append >> /()/ * /b/ `] = lit`
(0) -> (1) : ε

(1) -> (2) : ε

(2) -> [3] : b

[3] -> none
`;

module.exports[n`ENFA >> append >> /()/ * /b?/ `] = lit`
(0) -> (1) : ε

(1) -> (2) : ε

(2) -> (3) : b
    -> [4] : ε

(3) -> [4] : ε

[4] -> none
`;

module.exports[n`ENFA >> append >> /()/ * /b*/ `] = lit`
(0) -> (1) : ε

(1) -> (2) : ε

(2) -> (3) : ε
    -> [4] : ε

(3) -> (5) : b

[4] -> none

(5) -> (3) : ε
    -> [4] : ε
`;

module.exports[n`ENFA >> append >> /()/ * /b+/ `] = lit`
(0) -> (1) : ε

(1) -> (2) : ε

(2) -> (3) : ε

(3) -> (4) : b

(4) -> (3) : ε
    -> [5] : ε

[5] -> none
`;

module.exports[n`ENFA >> append >> /a/ * /()/ `] = lit`
(0) -> (1) : a

(1) -> (2) : ε

(2) -> [3] : ε

[3] -> none
`;

module.exports[n`ENFA >> append >> /a/ * /b/ `] = lit`
(0) -> (1) : a

(1) -> (2) : ε

(2) -> [3] : b

[3] -> none
`;

module.exports[n`ENFA >> append >> /a/ * /b?/ `] = lit`
(0) -> (1) : a

(1) -> (2) : ε

(2) -> (3) : b
    -> [4] : ε

(3) -> [4] : ε

[4] -> none
`;

module.exports[n`ENFA >> append >> /a/ * /b*/ `] = lit`
(0) -> (1) : a

(1) -> (2) : ε

(2) -> (3) : ε
    -> [4] : ε

(3) -> (5) : b

[4] -> none

(5) -> (3) : ε
    -> [4] : ε
`;

module.exports[n`ENFA >> append >> /a/ * /b+/ `] = lit`
(0) -> (1) : a

(1) -> (2) : ε

(2) -> (3) : ε

(3) -> (4) : b

(4) -> (3) : ε
    -> [5] : ε

[5] -> none
`;

module.exports[n`ENFA >> append >> /a?/ * /()/ `] = lit`
(0) -> (1) : a
    -> (2) : ε

(1) -> (2) : ε

(2) -> (3) : ε

(3) -> [4] : ε

[4] -> none
`;

module.exports[n`ENFA >> append >> /a?/ * /b/ `] = lit`
(0) -> (1) : a
    -> (2) : ε

(1) -> (2) : ε

(2) -> (3) : ε

(3) -> [4] : b

[4] -> none
`;

module.exports[n`ENFA >> append >> /a?/ * /b?/ `] = lit`
(0) -> (1) : a
    -> (2) : ε

(1) -> (2) : ε

(2) -> (3) : ε

(3) -> (4) : b
    -> [5] : ε

(4) -> [5] : ε

[5] -> none
`;

module.exports[n`ENFA >> append >> /a?/ * /b*/ `] = lit`
(0) -> (1) : a
    -> (2) : ε

(1) -> (2) : ε

(2) -> (3) : ε

(3) -> (4) : ε
    -> [5] : ε

(4) -> (6) : b

[5] -> none

(6) -> (4) : ε
    -> [5] : ε
`;

module.exports[n`ENFA >> append >> /a?/ * /b+/ `] = lit`
(0) -> (1) : a
    -> (2) : ε

(1) -> (2) : ε

(2) -> (3) : ε

(3) -> (4) : ε

(4) -> (5) : b

(5) -> (4) : ε
    -> [6] : ε

[6] -> none
`;

module.exports[n`ENFA >> append >> /a*/ * /()/ `] = lit`
(0) -> (1) : ε
    -> (2) : ε

(1) -> (3) : a

(2) -> (4) : ε

(3) -> (1) : ε
    -> (2) : ε

(4) -> [5] : ε

[5] -> none
`;

module.exports[n`ENFA >> append >> /a*/ * /b/ `] = lit`
(0) -> (1) : ε
    -> (2) : ε

(1) -> (3) : a

(2) -> (4) : ε

(3) -> (1) : ε
    -> (2) : ε

(4) -> [5] : b

[5] -> none
`;

module.exports[n`ENFA >> append >> /a*/ * /b?/ `] = lit`
(0) -> (1) : ε
    -> (2) : ε

(1) -> (3) : a

(2) -> (4) : ε

(3) -> (1) : ε
    -> (2) : ε

(4) -> (5) : b
    -> [6] : ε

(5) -> [6] : ε

[6] -> none
`;

module.exports[n`ENFA >> append >> /a*/ * /b*/ `] = lit`
(0) -> (1) : ε
    -> (2) : ε

(1) -> (3) : a

(2) -> (4) : ε

(3) -> (1) : ε
    -> (2) : ε

(4) -> (5) : ε
    -> [6] : ε

(5) -> (7) : b

[6] -> none

(7) -> (5) : ε
    -> [6] : ε
`;

module.exports[n`ENFA >> append >> /a*/ * /b+/ `] = lit`
(0) -> (1) : ε
    -> (2) : ε

(1) -> (3) : a

(2) -> (4) : ε

(3) -> (1) : ε
    -> (2) : ε

(4) -> (5) : ε

(5) -> (6) : b

(6) -> (5) : ε
    -> [7] : ε

[7] -> none
`;

module.exports[n`ENFA >> append >> /a+/ * /()/ `] = lit`
(0) -> (1) : ε

(1) -> (2) : a

(2) -> (1) : ε
    -> (3) : ε

(3) -> (4) : ε

(4) -> [5] : ε

[5] -> none
`;

module.exports[n`ENFA >> append >> /a+/ * /b/ `] = lit`
(0) -> (1) : ε

(1) -> (2) : a

(2) -> (1) : ε
    -> (3) : ε

(3) -> (4) : ε

(4) -> [5] : b

[5] -> none
`;

module.exports[n`ENFA >> append >> /a+/ * /b?/ `] = lit`
(0) -> (1) : ε

(1) -> (2) : a

(2) -> (1) : ε
    -> (3) : ε

(3) -> (4) : ε

(4) -> (5) : b
    -> [6] : ε

(5) -> [6] : ε

[6] -> none
`;

module.exports[n`ENFA >> append >> /a+/ * /b*/ `] = lit`
(0) -> (1) : ε

(1) -> (2) : a

(2) -> (1) : ε
    -> (3) : ε

(3) -> (4) : ε

(4) -> (5) : ε
    -> [6] : ε

(5) -> (7) : b

[6] -> none

(7) -> (5) : ε
    -> [6] : ε
`;

module.exports[n`ENFA >> append >> /a+/ * /b+/ `] = lit`
(0) -> (1) : ε

(1) -> (2) : a

(2) -> (1) : ε
    -> (3) : ε

(3) -> (4) : ε

(4) -> (5) : ε

(5) -> (6) : b

(6) -> (5) : ε
    -> [7] : ε

[7] -> none
`;

module.exports[n`ENFA >> append >> /ab/ * /ba/ `] = lit`
(0) -> (1) : a

(1) -> (2) : b

(2) -> (3) : ε

(3) -> (4) : b

(4) -> [5] : a

[5] -> none
`;

module.exports[n`ENFA >> append >> /foo/ * /bar/ `] = lit`
(0) -> (1) : f

(1) -> (2) : o

(2) -> (3) : o

(3) -> (4) : ε

(4) -> (5) : b

(5) -> (6) : a

(6) -> [7] : r

[7] -> none
`;

module.exports[n`ENFA >> append >> /a/ * /a*/ `] = lit`
(0) -> (1) : a

(1) -> (2) : ε

(2) -> (3) : ε
    -> [4] : ε

(3) -> (5) : a

[4] -> none

(5) -> (3) : ε
    -> [4] : ε
`;

module.exports[n`ENFA >> append >> /a*/ * /a*b*c*/ `] = lit`
(0) -> (1) : ε
    -> (2) : ε

(1) -> (3) : a

(2) -> (4) : ε

(3) -> (1) : ε
    -> (2) : ε

(4) -> (5) : ε
    -> (6) : ε

(5) -> (7) : a

(6) -> (8) : ε
    -> (9) : ε

(7) -> (5) : ε
    -> (6) : ε

(8) -> (10) : b

(9) -> (11) : ε
    -> [12] : ε

(10) -> (8) : ε
     -> (9) : ε

(11) -> (13) : c

[12] -> none

(13) -> (11) : ε
     -> [12] : ε
`;

module.exports[n`ENFA >> append >> /a|b|c{2}/ * /a{2}|b{2}|c/ `] = lit`
(0) -> (1) : a
    -> (2) : b
    -> (3) : c

(1) -> (4) : ε

(2) -> (4) : ε

(3) -> (5) : c

(4) -> (6) : ε

(5) -> (4) : ε

(6) -> (7) : a
    -> (8) : b
    -> (9) : c

(7) -> (10) : a

(8) -> (11) : b

(9) -> [12] : ε

(10) -> [12] : ε

(11) -> [12] : ε

[12] -> none
`;

module.exports[n`ENFA >> append >> /ba/ * /ab/ `] = lit`
(0) -> (1) : b

(1) -> (2) : a

(2) -> (3) : ε

(3) -> (4) : a

(4) -> [5] : b

[5] -> none
`;

module.exports[n`ENFA >> append >> /bar/ * /foo/ `] = lit`
(0) -> (1) : b

(1) -> (2) : a

(2) -> (3) : r

(3) -> (4) : ε

(4) -> (5) : f

(5) -> (6) : o

(6) -> [7] : o

[7] -> none
`;

module.exports[n`ENFA >> append >> /a*/ * /a/ `] = lit`
(0) -> (1) : ε
    -> (2) : ε

(1) -> (3) : a

(2) -> (4) : ε

(3) -> (1) : ε
    -> (2) : ε

(4) -> [5] : a

[5] -> none
`;

module.exports[n`ENFA >> append >> /a*b*c*/ * /a*/ `] = lit`
(0) -> (1) : ε
    -> (2) : ε

(1) -> (3) : a

(2) -> (4) : ε
    -> (5) : ε

(3) -> (1) : ε
    -> (2) : ε

(4) -> (6) : b

(5) -> (7) : ε
    -> (8) : ε

(6) -> (4) : ε
    -> (5) : ε

(7) -> (9) : c

(8) -> (10) : ε

(9) -> (7) : ε
    -> (8) : ε

(10) -> (11) : ε
     -> [12] : ε

(11) -> (13) : a

[12] -> none

(13) -> (11) : ε
     -> [12] : ε
`;

module.exports[n`ENFA >> append >> /a{2}|b{2}|c/ * /a|b|c{2}/ `] = lit`
(0) -> (1) : a
    -> (2) : b
    -> (3) : c

(1) -> (4) : a

(2) -> (5) : b

(3) -> (6) : ε

(4) -> (6) : ε

(5) -> (6) : ε

(6) -> (7) : ε

(7) -> (8) : a
    -> (9) : b
    -> (10) : c

(8) -> [11] : ε

(9) -> [11] : ε

(10) -> (12) : c

[11] -> none

(12) -> [11] : ε
`;

module.exports[n`ENFA >> prepend >> /()/ * /()/ `] = lit`
(0) -> (1) : ε

(1) -> (2) : ε

(2) -> [3] : ε

[3] -> none
`;

module.exports[n`ENFA >> prepend >> /b/ * /()/ `] = lit`
(0) -> (1) : b

(1) -> (2) : ε

(2) -> [3] : ε

[3] -> none
`;

module.exports[n`ENFA >> prepend >> /b?/ * /()/ `] = lit`
(0) -> (1) : b
    -> (2) : ε

(1) -> (2) : ε

(2) -> (3) : ε

(3) -> [4] : ε

[4] -> none
`;

module.exports[n`ENFA >> prepend >> /b*/ * /()/ `] = lit`
(0) -> (1) : ε
    -> (2) : ε

(1) -> (3) : b

(2) -> (4) : ε

(3) -> (1) : ε
    -> (2) : ε

(4) -> [5] : ε

[5] -> none
`;

module.exports[n`ENFA >> prepend >> /b+/ * /()/ `] = lit`
(0) -> (1) : ε

(1) -> (2) : b

(2) -> (1) : ε
    -> (3) : ε

(3) -> (4) : ε

(4) -> [5] : ε

[5] -> none
`;

module.exports[n`ENFA >> prepend >> /()/ * /a/ `] = lit`
(0) -> (1) : ε

(1) -> (2) : ε

(2) -> [3] : a

[3] -> none
`;

module.exports[n`ENFA >> prepend >> /b/ * /a/ `] = lit`
(0) -> (1) : b

(1) -> (2) : ε

(2) -> [3] : a

[3] -> none
`;

module.exports[n`ENFA >> prepend >> /b?/ * /a/ `] = lit`
(0) -> (1) : b
    -> (2) : ε

(1) -> (2) : ε

(2) -> (3) : ε

(3) -> [4] : a

[4] -> none
`;

module.exports[n`ENFA >> prepend >> /b*/ * /a/ `] = lit`
(0) -> (1) : ε
    -> (2) : ε

(1) -> (3) : b

(2) -> (4) : ε

(3) -> (1) : ε
    -> (2) : ε

(4) -> [5] : a

[5] -> none
`;

module.exports[n`ENFA >> prepend >> /b+/ * /a/ `] = lit`
(0) -> (1) : ε

(1) -> (2) : b

(2) -> (1) : ε
    -> (3) : ε

(3) -> (4) : ε

(4) -> [5] : a

[5] -> none
`;

module.exports[n`ENFA >> prepend >> /()/ * /a?/ `] = lit`
(0) -> (1) : ε

(1) -> (2) : ε

(2) -> (3) : a
    -> [4] : ε

(3) -> [4] : ε

[4] -> none
`;

module.exports[n`ENFA >> prepend >> /b/ * /a?/ `] = lit`
(0) -> (1) : b

(1) -> (2) : ε

(2) -> (3) : a
    -> [4] : ε

(3) -> [4] : ε

[4] -> none
`;

module.exports[n`ENFA >> prepend >> /b?/ * /a?/ `] = lit`
(0) -> (1) : b
    -> (2) : ε

(1) -> (2) : ε

(2) -> (3) : ε

(3) -> (4) : a
    -> [5] : ε

(4) -> [5] : ε

[5] -> none
`;

module.exports[n`ENFA >> prepend >> /b*/ * /a?/ `] = lit`
(0) -> (1) : ε
    -> (2) : ε

(1) -> (3) : b

(2) -> (4) : ε

(3) -> (1) : ε
    -> (2) : ε

(4) -> (5) : a
    -> [6] : ε

(5) -> [6] : ε

[6] -> none
`;

module.exports[n`ENFA >> prepend >> /b+/ * /a?/ `] = lit`
(0) -> (1) : ε

(1) -> (2) : b

(2) -> (1) : ε
    -> (3) : ε

(3) -> (4) : ε

(4) -> (5) : a
    -> [6] : ε

(5) -> [6] : ε

[6] -> none
`;

module.exports[n`ENFA >> prepend >> /()/ * /a*/ `] = lit`
(0) -> (1) : ε

(1) -> (2) : ε

(2) -> (3) : ε
    -> [4] : ε

(3) -> (5) : a

[4] -> none

(5) -> (3) : ε
    -> [4] : ε
`;

module.exports[n`ENFA >> prepend >> /b/ * /a*/ `] = lit`
(0) -> (1) : b

(1) -> (2) : ε

(2) -> (3) : ε
    -> [4] : ε

(3) -> (5) : a

[4] -> none

(5) -> (3) : ε
    -> [4] : ε
`;

module.exports[n`ENFA >> prepend >> /b?/ * /a*/ `] = lit`
(0) -> (1) : b
    -> (2) : ε

(1) -> (2) : ε

(2) -> (3) : ε

(3) -> (4) : ε
    -> [5] : ε

(4) -> (6) : a

[5] -> none

(6) -> (4) : ε
    -> [5] : ε
`;

module.exports[n`ENFA >> prepend >> /b*/ * /a*/ `] = lit`
(0) -> (1) : ε
    -> (2) : ε

(1) -> (3) : b

(2) -> (4) : ε

(3) -> (1) : ε
    -> (2) : ε

(4) -> (5) : ε
    -> [6] : ε

(5) -> (7) : a

[6] -> none

(7) -> (5) : ε
    -> [6] : ε
`;

module.exports[n`ENFA >> prepend >> /b+/ * /a*/ `] = lit`
(0) -> (1) : ε

(1) -> (2) : b

(2) -> (1) : ε
    -> (3) : ε

(3) -> (4) : ε

(4) -> (5) : ε
    -> [6] : ε

(5) -> (7) : a

[6] -> none

(7) -> (5) : ε
    -> [6] : ε
`;

module.exports[n`ENFA >> prepend >> /()/ * /a+/ `] = lit`
(0) -> (1) : ε

(1) -> (2) : ε

(2) -> (3) : ε

(3) -> (4) : a

(4) -> (3) : ε
    -> [5] : ε

[5] -> none
`;

module.exports[n`ENFA >> prepend >> /b/ * /a+/ `] = lit`
(0) -> (1) : b

(1) -> (2) : ε

(2) -> (3) : ε

(3) -> (4) : a

(4) -> (3) : ε
    -> [5] : ε

[5] -> none
`;

module.exports[n`ENFA >> prepend >> /b?/ * /a+/ `] = lit`
(0) -> (1) : b
    -> (2) : ε

(1) -> (2) : ε

(2) -> (3) : ε

(3) -> (4) : ε

(4) -> (5) : a

(5) -> (4) : ε
    -> [6] : ε

[6] -> none
`;

module.exports[n`ENFA >> prepend >> /b*/ * /a+/ `] = lit`
(0) -> (1) : ε
    -> (2) : ε

(1) -> (3) : b

(2) -> (4) : ε

(3) -> (1) : ε
    -> (2) : ε

(4) -> (5) : ε

(5) -> (6) : a

(6) -> (5) : ε
    -> [7] : ε

[7] -> none
`;

module.exports[n`ENFA >> prepend >> /b+/ * /a+/ `] = lit`
(0) -> (1) : ε

(1) -> (2) : b

(2) -> (1) : ε
    -> (3) : ε

(3) -> (4) : ε

(4) -> (5) : ε

(5) -> (6) : a

(6) -> (5) : ε
    -> [7] : ε

[7] -> none
`;

module.exports[n`ENFA >> prepend >> /ba/ * /ab/ `] = lit`
(0) -> (1) : b

(1) -> (2) : a

(2) -> (3) : ε

(3) -> (4) : a

(4) -> [5] : b

[5] -> none
`;

module.exports[n`ENFA >> prepend >> /bar/ * /foo/ `] = lit`
(0) -> (1) : b

(1) -> (2) : a

(2) -> (3) : r

(3) -> (4) : ε

(4) -> (5) : f

(5) -> (6) : o

(6) -> [7] : o

[7] -> none
`;

module.exports[n`ENFA >> prepend >> /a*/ * /a/ `] = lit`
(0) -> (1) : ε
    -> (2) : ε

(1) -> (3) : a

(2) -> (4) : ε

(3) -> (1) : ε
    -> (2) : ε

(4) -> [5] : a

[5] -> none
`;

module.exports[n`ENFA >> prepend >> /a*b*c*/ * /a*/ `] = lit`
(0) -> (1) : ε
    -> (2) : ε

(1) -> (3) : a

(2) -> (4) : ε
    -> (5) : ε

(3) -> (1) : ε
    -> (2) : ε

(4) -> (6) : b

(5) -> (7) : ε
    -> (8) : ε

(6) -> (4) : ε
    -> (5) : ε

(7) -> (9) : c

(8) -> (10) : ε

(9) -> (7) : ε
    -> (8) : ε

(10) -> (11) : ε
     -> [12] : ε

(11) -> (13) : a

[12] -> none

(13) -> (11) : ε
     -> [12] : ε
`;

module.exports[n`ENFA >> prepend >> /a{2}|b{2}|c/ * /a|b|c{2}/ `] = lit`
(0) -> (1) : a
    -> (2) : b
    -> (3) : c

(1) -> (4) : a

(2) -> (5) : b

(3) -> (6) : ε

(4) -> (6) : ε

(5) -> (6) : ε

(6) -> (7) : ε

(7) -> (8) : a
    -> (9) : b
    -> (10) : c

(8) -> [11] : ε

(9) -> [11] : ε

(10) -> (12) : c

[11] -> none

(12) -> [11] : ε
`;

module.exports[n`ENFA >> prepend >> /ab/ * /ba/ `] = lit`
(0) -> (1) : a

(1) -> (2) : b

(2) -> (3) : ε

(3) -> (4) : b

(4) -> [5] : a

[5] -> none
`;

module.exports[n`ENFA >> prepend >> /foo/ * /bar/ `] = lit`
(0) -> (1) : f

(1) -> (2) : o

(2) -> (3) : o

(3) -> (4) : ε

(4) -> (5) : b

(5) -> (6) : a

(6) -> [7] : r

[7] -> none
`;

module.exports[n`ENFA >> prepend >> /a/ * /a*/ `] = lit`
(0) -> (1) : a

(1) -> (2) : ε

(2) -> (3) : ε
    -> [4] : ε

(3) -> (5) : a

[4] -> none

(5) -> (3) : ε
    -> [4] : ε
`;

module.exports[n`ENFA >> prepend >> /a*/ * /a*b*c*/ `] = lit`
(0) -> (1) : ε
    -> (2) : ε

(1) -> (3) : a

(2) -> (4) : ε

(3) -> (1) : ε
    -> (2) : ε

(4) -> (5) : ε
    -> (6) : ε

(5) -> (7) : a

(6) -> (8) : ε
    -> (9) : ε

(7) -> (5) : ε
    -> (6) : ε

(8) -> (10) : b

(9) -> (11) : ε
    -> [12] : ε

(10) -> (8) : ε
     -> (9) : ε

(11) -> (13) : c

[12] -> none

(13) -> (11) : ε
     -> [12] : ε
`;

module.exports[n`ENFA >> prepend >> /a|b|c{2}/ * /a{2}|b{2}|c/ `] = lit`
(0) -> (1) : a
    -> (2) : b
    -> (3) : c

(1) -> (4) : ε

(2) -> (4) : ε

(3) -> (5) : c

(4) -> (6) : ε

(5) -> (4) : ε

(6) -> (7) : a
    -> (8) : b
    -> (9) : c

(7) -> (10) : a

(8) -> (11) : b

(9) -> [12] : ε

(10) -> [12] : ε

(11) -> [12] : ε

[12] -> none
`;

module.exports[n`ENFA >> quantify >> /a/{1,1} `] = lit`
(0) -> [1] : a

[1] -> none
`;

module.exports[n`ENFA >> quantify >> /a*/{1,1} `] = lit`
(0) -> (1) : ε
    -> [2] : ε

(1) -> (3) : a

[2] -> none

(3) -> (1) : ε
    -> [2] : ε
`;

module.exports[n`ENFA >> quantify >> /a/{1,1}? `] = lit`
(0) -> [1] : a

[1] -> none
`;

module.exports[n`ENFA >> quantify >> /a*/{1,1}? `] = lit`
(0) -> (1) : ε
    -> [2] : ε

(1) -> (3) : a

[2] -> none

(3) -> (1) : ε
    -> [2] : ε
`;

module.exports[n`ENFA >> quantify >> /a/{0,1} `] = lit`
(0) -> (1) : ε
    -> [2] : ε

(1) -> [2] : a

[2] -> none
`;

module.exports[n`ENFA >> quantify >> /(ab)*/{0,1} `] = lit`
(0) -> (1) : ε
    -> [2] : ε

(1) -> (3) : ε
    -> [2] : ε

[2] -> none

(3) -> (4) : a

(4) -> (5) : b

(5) -> (3) : ε
    -> [2] : ε
`;

module.exports[n`ENFA >> quantify >> /(ab)+/{0,1} `] = lit`
(0) -> (1) : ε
    -> [2] : ε

(1) -> (3) : ε

[2] -> none

(3) -> (4) : a

(4) -> (5) : b

(5) -> (3) : ε
    -> [2] : ε
`;

module.exports[n`ENFA >> quantify >> /a/{0,1}? `] = lit`
(0) -> [1] : ε
    -> (2) : ε

[1] -> none

(2) -> [1] : a
`;

module.exports[n`ENFA >> quantify >> /(ab)*/{0,1}? `] = lit`
(0) -> [1] : ε
    -> (2) : ε

[1] -> none

(2) -> (3) : ε
    -> [1] : ε

(3) -> (4) : a

(4) -> (5) : b

(5) -> (3) : ε
    -> [1] : ε
`;

module.exports[n`ENFA >> quantify >> /(ab)+/{0,1}? `] = lit`
(0) -> [1] : ε
    -> (2) : ε

[1] -> none

(2) -> (3) : ε

(3) -> (4) : a

(4) -> (5) : b

(5) -> (3) : ε
    -> [1] : ε
`;

module.exports[n`ENFA >> quantify >> /a/{3,3} `] = lit`
(0) -> (1) : a

(1) -> (2) : ε

(2) -> (3) : a

(3) -> (4) : ε

(4) -> [5] : a

[5] -> none
`;

module.exports[n`ENFA >> quantify >> /(ab)*/{3,3} `] = lit`
(0) -> (1) : ε
    -> (2) : ε

(1) -> (3) : a

(2) -> (4) : ε

(3) -> (5) : b

(4) -> (6) : ε
    -> (7) : ε

(5) -> (1) : ε
    -> (2) : ε

(6) -> (8) : a

(7) -> (9) : ε

(8) -> (10) : b

(9) -> (11) : ε
    -> [12] : ε

(10) -> (6) : ε
     -> (7) : ε

(11) -> (13) : a

[12] -> none

(13) -> (14) : b

(14) -> (11) : ε
     -> [12] : ε
`;

module.exports[n`ENFA >> quantify >> /(ab)+/{3,3} `] = lit`
(0) -> (1) : ε

(1) -> (2) : a

(2) -> (3) : b

(3) -> (1) : ε
    -> (4) : ε

(4) -> (5) : ε

(5) -> (6) : ε

(6) -> (7) : a

(7) -> (8) : b

(8) -> (6) : ε
    -> (9) : ε

(9) -> (10) : ε

(10) -> (11) : ε

(11) -> (12) : a

(12) -> (13) : b

(13) -> (11) : ε
     -> [14] : ε

[14] -> none
`;

module.exports[n`ENFA >> quantify >> /a/{3,3}? `] = lit`
(0) -> (1) : a

(1) -> (2) : ε

(2) -> (3) : a

(3) -> (4) : ε

(4) -> [5] : a

[5] -> none
`;

module.exports[n`ENFA >> quantify >> /(ab)*/{3,3}? `] = lit`
(0) -> (1) : ε
    -> (2) : ε

(1) -> (3) : a

(2) -> (4) : ε

(3) -> (5) : b

(4) -> (6) : ε
    -> (7) : ε

(5) -> (1) : ε
    -> (2) : ε

(6) -> (8) : a

(7) -> (9) : ε

(8) -> (10) : b

(9) -> (11) : ε
    -> [12] : ε

(10) -> (6) : ε
     -> (7) : ε

(11) -> (13) : a

[12] -> none

(13) -> (14) : b

(14) -> (11) : ε
     -> [12] : ε
`;

module.exports[n`ENFA >> quantify >> /(ab)+/{3,3}? `] = lit`
(0) -> (1) : ε

(1) -> (2) : a

(2) -> (3) : b

(3) -> (1) : ε
    -> (4) : ε

(4) -> (5) : ε

(5) -> (6) : ε

(6) -> (7) : a

(7) -> (8) : b

(8) -> (6) : ε
    -> (9) : ε

(9) -> (10) : ε

(10) -> (11) : ε

(11) -> (12) : a

(12) -> (13) : b

(13) -> (11) : ε
     -> [14] : ε

[14] -> none
`;

module.exports[n`ENFA >> quantify >> /a/{0,3} `] = lit`
(0) -> (1) : ε
    -> [2] : ε

(1) -> (3) : a

[2] -> none

(3) -> (4) : ε
    -> [2] : ε

(4) -> (5) : a

(5) -> (6) : ε
    -> [2] : ε

(6) -> [2] : a
`;

module.exports[n`ENFA >> quantify >> /(ab)*/{0,3} `] = lit`
(0) -> (1) : ε
    -> [2] : ε

(1) -> (3) : ε
    -> (4) : ε

[2] -> none

(3) -> (5) : a

(4) -> (6) : ε
    -> [2] : ε

(5) -> (7) : b

(6) -> (8) : ε
    -> (9) : ε

(7) -> (3) : ε
    -> (4) : ε

(8) -> (10) : a

(9) -> (11) : ε
    -> [2] : ε

(10) -> (12) : b

(11) -> (13) : ε
     -> [2] : ε

(12) -> (8) : ε
     -> (9) : ε

(13) -> (14) : a

(14) -> (15) : b

(15) -> (13) : ε
     -> [2] : ε
`;

module.exports[n`ENFA >> quantify >> /(ab)+/{0,3} `] = lit`
(0) -> (1) : ε
    -> [2] : ε

(1) -> (3) : ε

[2] -> none

(3) -> (4) : a

(4) -> (5) : b

(5) -> (3) : ε
    -> (6) : ε

(6) -> (7) : ε
    -> [2] : ε

(7) -> (8) : ε

(8) -> (9) : a

(9) -> (10) : b

(10) -> (8) : ε
     -> (11) : ε

(11) -> (12) : ε
     -> [2] : ε

(12) -> (13) : ε

(13) -> (14) : a

(14) -> (15) : b

(15) -> (13) : ε
     -> [2] : ε
`;

module.exports[n`ENFA >> quantify >> /a/{0,3}? `] = lit`
(0) -> [1] : ε
    -> (2) : ε

[1] -> none

(2) -> (3) : a

(3) -> [1] : ε
    -> (4) : ε

(4) -> (5) : a

(5) -> [1] : ε
    -> (6) : ε

(6) -> [1] : a
`;

module.exports[n`ENFA >> quantify >> /(ab)*/{0,3}? `] = lit`
(0) -> [1] : ε
    -> (2) : ε

[1] -> none

(2) -> (3) : ε
    -> (4) : ε

(3) -> (5) : a

(4) -> [1] : ε
    -> (6) : ε

(5) -> (7) : b

(6) -> (8) : ε
    -> (9) : ε

(7) -> (3) : ε
    -> (4) : ε

(8) -> (10) : a

(9) -> [1] : ε
    -> (11) : ε

(10) -> (12) : b

(11) -> (13) : ε
     -> [1] : ε

(12) -> (8) : ε
     -> (9) : ε

(13) -> (14) : a

(14) -> (15) : b

(15) -> (13) : ε
     -> [1] : ε
`;

module.exports[n`ENFA >> quantify >> /(ab)+/{0,3}? `] = lit`
(0) -> [1] : ε
    -> (2) : ε

[1] -> none

(2) -> (3) : ε

(3) -> (4) : a

(4) -> (5) : b

(5) -> (3) : ε
    -> (6) : ε

(6) -> [1] : ε
    -> (7) : ε

(7) -> (8) : ε

(8) -> (9) : a

(9) -> (10) : b

(10) -> (8) : ε
     -> (11) : ε

(11) -> [1] : ε
     -> (12) : ε

(12) -> (13) : ε

(13) -> (14) : a

(14) -> (15) : b

(15) -> (13) : ε
     -> [1] : ε
`;

module.exports[n`ENFA >> quantify >> /a/{0,} `] = lit`
(0) -> (1) : ε
    -> [2] : ε

(1) -> (3) : a

[2] -> none

(3) -> (1) : ε
    -> [2] : ε
`;

module.exports[n`ENFA >> quantify >> /(ab)*/{0,} `] = lit`
(0) -> (1) : ε
    -> [2] : ε

(1) -> (3) : ε
    -> (4) : ε

[2] -> none

(3) -> (5) : a

(4) -> (1) : ε
    -> [2] : ε

(5) -> (6) : b

(6) -> (3) : ε
    -> (4) : ε
`;

module.exports[n`ENFA >> quantify >> /(ab)+/{0,} `] = lit`
(0) -> (1) : ε
    -> [2] : ε

(1) -> (3) : ε

[2] -> none

(3) -> (4) : a

(4) -> (5) : b

(5) -> (3) : ε
    -> (6) : ε

(6) -> (1) : ε
    -> [2] : ε
`;

module.exports[n`ENFA >> quantify >> /a/{0,}? `] = lit`
(0) -> [1] : ε
    -> (2) : ε

[1] -> none

(2) -> (3) : a

(3) -> [1] : ε
    -> (2) : ε
`;

module.exports[n`ENFA >> quantify >> /(ab)*/{0,}? `] = lit`
(0) -> [1] : ε
    -> (2) : ε

[1] -> none

(2) -> (3) : ε
    -> (4) : ε

(3) -> (5) : a

(4) -> [1] : ε
    -> (2) : ε

(5) -> (6) : b

(6) -> (3) : ε
    -> (4) : ε
`;

module.exports[n`ENFA >> quantify >> /(ab)+/{0,}? `] = lit`
(0) -> [1] : ε
    -> (2) : ε

[1] -> none

(2) -> (3) : ε

(3) -> (4) : a

(4) -> (5) : b

(5) -> (3) : ε
    -> (6) : ε

(6) -> [1] : ε
    -> (2) : ε
`;

module.exports[n`ENFA >> quantify >> /a/{3,} `] = lit`
(0) -> (1) : a

(1) -> (2) : ε

(2) -> (3) : a

(3) -> (4) : ε

(4) -> (5) : a

(5) -> (4) : ε
    -> [6] : ε

[6] -> none
`;

module.exports[n`ENFA >> quantify >> /(ab)*/{3,} `] = lit`
(0) -> (1) : ε
    -> (2) : ε

(1) -> (3) : a

(2) -> (4) : ε

(3) -> (5) : b

(4) -> (6) : ε
    -> (7) : ε

(5) -> (1) : ε
    -> (2) : ε

(6) -> (8) : a

(7) -> (9) : ε

(8) -> (10) : b

(9) -> (11) : ε
    -> (12) : ε

(10) -> (6) : ε
     -> (7) : ε

(11) -> (13) : a

(12) -> (9) : ε
     -> [14] : ε

(13) -> (15) : b

[14] -> none

(15) -> (11) : ε
     -> (12) : ε
`;

module.exports[n`ENFA >> quantify >> /(ab)+/{3,} `] = lit`
(0) -> (1) : ε

(1) -> (2) : a

(2) -> (3) : b

(3) -> (1) : ε
    -> (4) : ε

(4) -> (5) : ε

(5) -> (6) : ε

(6) -> (7) : a

(7) -> (8) : b

(8) -> (6) : ε
    -> (9) : ε

(9) -> (10) : ε

(10) -> (11) : ε

(11) -> (12) : a

(12) -> (13) : b

(13) -> (11) : ε
     -> (14) : ε

(14) -> (10) : ε
     -> [15] : ε

[15] -> none
`;

module.exports[n`ENFA >> quantify >> /a/{3,}? `] = lit`
(0) -> (1) : a

(1) -> (2) : ε

(2) -> (3) : a

(3) -> (4) : ε

(4) -> (5) : a

(5) -> [6] : ε
    -> (4) : ε

[6] -> none
`;

module.exports[n`ENFA >> quantify >> /(ab)*/{3,}? `] = lit`
(0) -> (1) : ε
    -> (2) : ε

(1) -> (3) : a

(2) -> (4) : ε

(3) -> (5) : b

(4) -> (6) : ε
    -> (7) : ε

(5) -> (1) : ε
    -> (2) : ε

(6) -> (8) : a

(7) -> (9) : ε

(8) -> (10) : b

(9) -> (11) : ε
    -> (12) : ε

(10) -> (6) : ε
     -> (7) : ε

(11) -> (13) : a

(12) -> [14] : ε
     -> (9) : ε

(13) -> (15) : b

[14] -> none

(15) -> (11) : ε
     -> (12) : ε
`;

module.exports[n`ENFA >> quantify >> /(ab)+/{3,}? `] = lit`
(0) -> (1) : ε

(1) -> (2) : a

(2) -> (3) : b

(3) -> (1) : ε
    -> (4) : ε

(4) -> (5) : ε

(5) -> (6) : ε

(6) -> (7) : a

(7) -> (8) : b

(8) -> (6) : ε
    -> (9) : ε

(9) -> (10) : ε

(10) -> (11) : ε

(11) -> (12) : a

(12) -> (13) : b

(13) -> (11) : ε
     -> (14) : ε

(14) -> [15] : ε
     -> (10) : ε

[15] -> none
`;

module.exports[n`ENFA >> withoutEmptyWord >> /a*b*c+/ `] = lit`
Before: /a*b*c+/
(0) -> (1) : ε
    -> (2) : ε

(1) -> (3) : a

(2) -> (4) : ε
    -> (5) : ε

(3) -> (1) : ε
    -> (2) : ε

(4) -> (6) : b

(5) -> (7) : ε

(6) -> (4) : ε
    -> (5) : ε

(7) -> (8) : c

(8) -> (7) : ε
    -> [9] : ε

[9] -> none


After: /a*b*c+/
(0) -> (1) : ε
    -> (2) : ε

(1) -> (3) : a

(2) -> (4) : ε
    -> (5) : ε

(3) -> (1) : ε
    -> (2) : ε

(4) -> (6) : b

(5) -> (7) : ε

(6) -> (4) : ε
    -> (5) : ε

(7) -> (8) : c

(8) -> (7) : ε
    -> [9] : ε

[9] -> none
`;

module.exports[n`ENFA >> withoutEmptyWord >> /a?b?/ `] = lit`
Before: /a?b?/
(0) -> (1) : a
    -> (2) : ε

(1) -> (2) : ε

(2) -> (3) : b
    -> [4] : ε

(3) -> [4] : ε

[4] -> none


After: /a|a?b/
(0) -> (1) : a
    -> (2) : b

(1) -> (3) : ε

(2) -> [4] : ε

(3) -> (2) : b
    -> [4] : ε

[4] -> none
`;

module.exports[n`ENFA >> withoutEmptyWord >> /a??b?/ `] = lit`
Before: /a??b?/
(0) -> (1) : ε
    -> (2) : a

(1) -> (3) : b
    -> [4] : ε

(2) -> (1) : ε

(3) -> [4] : ε

[4] -> none


After: /a|a?b/
(0) -> (1) : b
    -> (2) : a

(1) -> [3] : ε

(2) -> (4) : ε

[3] -> none

(4) -> (1) : b
    -> [3] : ε
`;

module.exports[n`ENFA >> withoutEmptyWord >> /a??b??/ `] = lit`
Before: /a??b??/
(0) -> (1) : ε
    -> (2) : a

(1) -> [3] : ε
    -> (4) : b

(2) -> (1) : ε

[3] -> none

(4) -> [3] : ε


After: /a|a?b/
(0) -> (1) : b
    -> (2) : a

(1) -> [3] : ε

(2) -> (4) : ε

[3] -> none

(4) -> [3] : ε
    -> (1) : b
`;

module.exports[n`ENFA >> withoutEmptyWord >> /a?b??/ `] = lit`
Before: /a?b??/
(0) -> (1) : a
    -> (2) : ε

(1) -> (2) : ε

(2) -> [3] : ε
    -> (4) : b

[3] -> none

(4) -> [3] : ε


After: /a|a?b/
(0) -> (1) : a
    -> (2) : b

(1) -> (3) : ε

(2) -> [4] : ε

(3) -> [4] : ε
    -> (2) : b

[4] -> none
`;

module.exports[n`ENFA >> withoutEmptyWord >> /a*b*c*/ `] = lit`
Before: /a*b*c*/
(0) -> (1) : ε
    -> (2) : ε

(1) -> (3) : a

(2) -> (4) : ε
    -> (5) : ε

(3) -> (1) : ε
    -> (2) : ε

(4) -> (6) : b

(5) -> (7) : ε
    -> [8] : ε

(6) -> (4) : ε
    -> (5) : ε

(7) -> (9) : c

[8] -> none

(9) -> (7) : ε
    -> [8] : ε


After: /a+|a*b+|(?:a*(?:a|b+))?c+/
(0) -> (1) : a
    -> (2) : b
    -> (3) : c

(1) -> (4) : ε
    -> (5) : ε

(2) -> (6) : ε
    -> (7) : ε

(3) -> (8) : ε
    -> [9] : ε

(4) -> (1) : a

(5) -> (6) : ε
    -> (7) : ε

(6) -> (2) : b

(7) -> (8) : ε
    -> [9] : ε

(8) -> (3) : c

[9] -> none
`;

module.exports[n`ENFA >> withoutEmptyWord >> /(a*b*c*)*/ `] = lit`
Before: /(a*b*c*)*/
(0) -> (1) : ε
    -> [2] : ε

(1) -> (3) : ε
    -> (4) : ε

[2] -> none

(3) -> (5) : a

(4) -> (6) : ε
    -> (7) : ε

(5) -> (3) : ε
    -> (4) : ε

(6) -> (8) : b

(7) -> (9) : ε
    -> (10) : ε

(8) -> (6) : ε
    -> (7) : ε

(9) -> (11) : c

(10) -> (1) : ε
     -> [2] : ε

(11) -> (9) : ε
     -> (10) : ε


After: /(?:c|(?:b|a+)b*)c*(?:a*b*c*)*/
(0) -> (1) : a
    -> (2) : b
    -> (3) : c

(1) -> (4) : ε
    -> (5) : ε

(2) -> (6) : ε
    -> (7) : ε

(3) -> (8) : ε
    -> (9) : ε

(4) -> (1) : a

(5) -> (6) : ε
    -> (7) : ε

(6) -> (2) : b

(7) -> (8) : ε
    -> (9) : ε

(8) -> (3) : c

(9) -> (10) : ε
    -> [11] : ε

(10) -> (4) : ε
     -> (5) : ε

[11] -> none
`;

module.exports[n`ENFA >> withoutEmptyWord >> /(a||b)(|c|d)(||f|g)/ `] = lit`
Before: /(a||b)(|c|d)(||f|g)/
(0) -> (1) : a
    -> (2) : ε
    -> (3) : b

(1) -> (4) : ε

(2) -> (4) : ε

(3) -> (4) : ε

(4) -> (5) : ε
    -> (6) : c
    -> (7) : d

(5) -> (8) : ε

(6) -> (8) : ε

(7) -> (8) : ε

(8) -> (9) : ε
    -> (10) : ε
    -> (11) : f
    -> (12) : g

(9) -> [13] : ε

(10) -> [13] : ε

(11) -> [13] : ε

(12) -> [13] : ε

[13] -> none


After: /[fg]|(?:c|[ab]c?|[ab]?d)[fg]?/
(0) -> (1) : a
    -> (2) : f
    -> (3) : g
    -> (4) : c
    -> (5) : d
    -> (6) : b

(1) -> (7) : ε

(2) -> [8] : ε

(3) -> [8] : ε

(4) -> (9) : ε

(5) -> (9) : ε

(6) -> (7) : ε

(7) -> (10) : ε
    -> (4) : c
    -> (5) : d

[8] -> none

(9) -> (11) : ε
    -> (12) : ε
    -> (2) : f
    -> (3) : g

(10) -> (9) : ε

(11) -> [8] : ε

(12) -> [8] : ε
`;

module.exports[n`ENFA >> withoutEmptyWord >> /((a||b)(|c|d)(||f|g))*/ `] = lit`
Before: /((a||b)(|c|d)(||f|g))*/
(0) -> (1) : ε
    -> [2] : ε

(1) -> (3) : a
    -> (4) : ε
    -> (5) : b

[2] -> none

(3) -> (6) : ε

(4) -> (6) : ε

(5) -> (6) : ε

(6) -> (7) : ε
    -> (8) : c
    -> (9) : d

(7) -> (10) : ε

(8) -> (10) : ε

(9) -> (10) : ε

(10) -> (11) : ε
     -> (12) : ε
     -> (13) : f
     -> (14) : g

(11) -> (15) : ε

(12) -> (15) : ε

(13) -> (15) : ε

(14) -> (15) : ε

(15) -> (1) : ε
     -> [2] : ε


After: /(?:[fg]|(?:[cd]|[ab][cd]?)[fg]?)(?:[ab]?[cd]?[fg]?)*/
(0) -> (1) : a
    -> (2) : f
    -> (3) : g
    -> (4) : c
    -> (5) : d
    -> (6) : b

(1) -> (7) : ε

(2) -> (8) : ε

(3) -> (8) : ε

(4) -> (9) : ε

(5) -> (9) : ε

(6) -> (7) : ε

(7) -> (10) : ε
    -> (4) : c
    -> (5) : d

(8) -> (11) : ε
    -> [12] : ε

(9) -> (13) : ε
    -> (14) : ε
    -> (2) : f
    -> (3) : g

(10) -> (9) : ε

(11) -> (1) : a
     -> (15) : ε
     -> (6) : b

[12] -> none

(13) -> (8) : ε

(14) -> (8) : ε

(15) -> (7) : ε
`;
